tap "adoptopenjdk/openjdk"
tap "dwarvesf/tap"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "ringohub/redis-cli"
tap "stripe/stripe-cli"
brew "libyaml"
brew "readline", link: true
brew "mise"
brew "awscli"
brew "bat"
brew "berkeley-db", link: true
brew "broot"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "tree-sitter"
brew "emacs"
brew "cask"
brew "llvm"
brew "ccls"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "fzf"
brew "libmpc"
brew "gcc"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "groonga"
brew "guile"
brew "httpie"
brew "jq"
brew "k6"
brew "lazygit"
brew "lsd"
brew "mas"
brew "luajit", args: ["HEAD"]
brew "mongosh"
brew "neovim"
brew "nmap"
brew "nvm"
brew "nyancat"
brew "openjdk@11"
brew "openjdk@17"
brew "pass"
brew "pngpaste"
brew "protobuf"
brew "ripgrep"
brew "terminal-notifier"
brew "thefuck"
brew "tmux"
brew "universal-ctags"
brew "vim"
brew "watchman"
brew "coreutils"
brew "gitleaks"
brew "yarn", link: false
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "hashicorp/tap/terraform-ls"
brew "mongodb/brew/mongodb-community"
brew "ringohub/redis-cli/redis-cli"
brew "stripe/stripe-cli/stripe"
cask "authy"
cask "chromium"
cask "datagrip"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "gureumkim"
cask "intellij-idea-ce"
cask "league-of-legends"
cask "mongodb-compass"
cask "mysqlworkbench"
cask "ngrok"
cask "notion"
cask "openinterminal-lite"
cask "openvpn-connect"
cask "session-manager-plugin"
# 추가된 앱들 (기존 수동 설치)
cask "aldente"
cask "alfred"
cask "appcleaner"
cask "clipy"
cask "cloudflare-warp"
cask "figma"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "karabiner-elements"
cask "postman"
cask "rectangle"
cask "slack"

# Mac App Store
mas "카카오톡", id: 869223134
mas "Allkdic", id: 1033453958
mas "DevCleaner", id: 1388020431
mas "EasyRes", id: 688211836
mas "Notability", id: 360593530
mas "Polaris Office", id: 1098211970
mas "QuickShade", id: 931571202
mas "Redacted", id: 984968384
mas "ScreenBrush", id: 1233965871
mas "Shazam", id: 897118787
mas "Snap", id: 418073146
mas "TestFlight", id: 899247664
