tap "adoptopenjdk/openjdk"
tap "dwarvesf/tap"
tap "hashicorp/tap"
# tap "homebrew/cask-fonts" # deprecated - fonts now in homebrew/cask
# tap "homebrew/services" # deprecated
tap "jesseduffield/lazygit"
tap "mongodb/brew"
# tap "ringohub/redis-cli" # broken download
tap "stripe/stripe-cli"

# ===========================================
# CLI Tools
# ===========================================
brew "readline", link: true
brew "awscli"
brew "bat"
brew "berkeley-db", link: true
brew "broot"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "tree-sitter"
brew "emacs"
brew "cask"
brew "llvm"
brew "ccls"
brew "direnv"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "fzf"
brew "libmpc"
brew "gcc"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "glow"
brew "gnupg"
brew "groonga"
brew "guile"
brew "httpie"
brew "jq"
brew "k6"
brew "lazygit"
brew "libyaml"
brew "lsd"
brew "luajit", args: ["HEAD"]
brew "mas"
brew "mise"
brew "mongosh"
brew "neovim"
brew "nmap"
# node는 mise로 관리
brew "nvm"
brew "nyancat"
brew "openjdk@11"
brew "openjdk@17"
brew "pass"
brew "pngpaste"
brew "protobuf"
brew "ripgrep"
brew "terminal-notifier"
brew "thefuck"
brew "tmux"
brew "universal-ctags"
brew "vim"
brew "watchman"
brew "yarn", link: false
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "hashicorp/tap/terraform-ls"
brew "mongodb/brew/mongodb-community"
# brew "ringohub/redis-cli/redis-cli" # broken download
brew "stripe/stripe-cli/stripe"

# ===========================================
# Casks (GUI Apps) - no sudo required
# ===========================================
cask "chromium"
cask "datagrip"
cask "dbeaver-community"
cask "discord"
cask "easydict"
cask "firefox"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "hammerspoon"
cask "intellij-idea-ce"
cask "league-of-legends"
cask "mongodb-compass"
cask "mysqlworkbench"
cask "ngrok"
cask "notion"
cask "openinterminal-lite"
cask "tandem"
cask "todoist-app"

# ===========================================
# Casks - sudo required (install manually)
# ===========================================
# cask "authy" # deprecated - 서비스 종료
# cask "docker-desktop" # sudo required
# cask "gureumkim" # sudo required (pkg installer)
# cask "openvpn-connect" # sudo required (pkg installer)
# cask "session-manager-plugin" # sudo required, deprecated 2026-09

# ===========================================
# Mac App Store (requires Apple ID login + sudo)
# Run manually: mas install <id>
# ===========================================
# mas "Alfred", id: 405843582
# mas "DevCleaner", id: 1388020431
# mas "GarageBand", id: 682658836
# mas "Hidden Bar", id: 1452453066
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "Notability", id: 360593530
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Polaris Office", id: 1098211970
# mas "QuickShade", id: 931571202
# mas "ScreenBrush", id: 1233965871
# mas "Shazam", id: 897118787
# mas "Slack", id: 803453959
# mas "Snap", id: 418073146
# mas "TestFlight", id: 899247664
# mas "카카오톡", id: 869223134
# Removed: EasyRes (688211836), Redacted (984968384) - no longer in App Store
